---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.IOException
source: html/4db30a10-cda9-56f0-6a99-65e9e5881280.htm
---
# IOException Members

Retrieves data needed to serialize the target object.